ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
#if !defined(RCC_CFGR1_SW_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_SW_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_SYSCLK_ENABLED == TRUE) &&    \
      (STM32_CFG_SYSCLK_SEL == RCC_CFGR1_SW_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by SYSCLK"
#endif

#if !defined(STM32_HSEDIV_ENABLED) && !defined(__DOXYGEN__)
  #error "STM32_HSEDIV_ENABLED not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_HSEDIV_ENABLED == TRUE))) &&  \
    !defined(__DOXYGEN__)
  #error "HSE not enabled, required by HSEDIV"
#endif

#if !defined(RCC_CFGR1_MCO1SEL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO1SEL_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_MCO1DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by MCO1DIV"
#endif

#if !defined(RCC_CFGR1_MCO2SEL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO2SEL_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_MCO2DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by MCO2DIV"
#endif

#if !defined(RCC_CCIPR1_ICLKSEL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_ICLKSEL_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_ICLK_ENABLED == TRUE) &&      \
      (STM32_CFG_ICLK_SEL == RCC_CCIPR1_ICLKSEL_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by ICLK"
#endif

#if !defined(RCC_CCIPR2_ADCDACSEL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR2_ADCDACSEL_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_ADCDAC_ENABLED == TRUE) &&    \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR2_ADCDACSEL_HSE))) &&               \
    !defined(__DOXYGEN__)
  #error "HSE not enabled, required by ADCDAC"
#endif

#if !defined(RCC_CCIPR2_SAI1SEL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR2_SAI1SEL_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_SAI1_ENABLED == TRUE) &&      \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by SAI1"
#endif

#if !defined(RCC_CCIPR2_ADF1SEL_HSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR2_ADF1SEL_HSE not defined"
#endif
#if !((STM32_HSE_ENABLED == TRUE) || !((STM32_ADF1_ENABLED == TRUE) &&      \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_HSE))) && !defined(__DOXYGEN__)
  #error "HSE not enabled, required by ADF1"
#endif

/**
 * @brief   HSE clock register bits.
 */
#if (STM32_HSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSE_BITS                    RCC_CR_HSEON
#else
  #define STM32_HSE_BITS                    0U
#endif

/**
 * @brief   High frequency external oscillator clock point.
 */
#if (STM32_HSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_HSE_FREQ                    STM32_HSECLK
#else
  #define STM32_HSE_FREQ                    0U
#endif

#if !((STM32_HSE_ENABLED != TRUE) || (STM32_HSE_FREQ >= STM32_HSECLK_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_HSE_FREQ below minimum frequency"
#endif

#if !((STM32_HSE_ENABLED != TRUE) || (STM32_HSE_FREQ <= STM32_HSECLK_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_HSE_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the LSE clock point. ---------------------------*/

#if !((STM32_CFG_LSE_ENABLE == TRUE) || (STM32_CFG_LSE_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LSE_ENABLE value specified"
#endif

#if !defined(RCC_CFGR1_MCO1SEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO1SEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_MCO1DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by MCO1DIV"
#endif

#if !defined(RCC_CFGR1_MCO2SEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO2SEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_MCO2DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by MCO2DIV"
#endif

#if !defined(RCC_BDCR_RTCSEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_BDCR_RTCSEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_RTC_ENABLED == TRUE) &&       \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by RTC"
#endif

#if !defined(RCC_BDCR_LSCOSEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_BDCR_LSCOSEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_LSCO_ENABLED == TRUE) &&      \
      (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSE))) && !defined(__DOXYGEN__)
  #error "LSE not enabled, required by LSCO"
#endif

#if !defined(RCC_CCIPR3_LPUART1SEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_LPUART1SEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_LPUART1_ENABLED == TRUE) &&   \
      (STM32_CFG_LPUART1_SEL == RCC_CCIPR3_LPUART1SEL_LSE))) &&             \
    !defined(__DOXYGEN__)
  #error "LSE not enabled, required by LPUART1"
#endif

#if !defined(RCC_CCIPR3_LPTIM1SEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_LPTIM1SEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_LPTIM1_ENABLED == TRUE) &&    \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_LSE))) &&               \
    !defined(__DOXYGEN__)
  #error "LSE not enabled, required by LPTIM1"
#endif

#if !defined(RCC_CCIPR1_LPTIM2SEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_LPTIM2SEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_LPTIM2_ENABLED == TRUE) &&    \
      (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_LSE))) &&               \
    !defined(__DOXYGEN__)
  #error "LSE not enabled, required by LPTIM2"
#endif

#if !defined(RCC_CCIPR3_LPTIM34SEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_LPTIM34SEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_LPTIM34_ENABLED == TRUE) &&   \
      (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_LSE))) &&             \
    !defined(__DOXYGEN__)
  #error "LSE not enabled, required by LPTIM34"
#endif

