ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
#if !defined(RCC_CCIPR1_SYSTICKSEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_SYSTICKSEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_SYSTICK_ENABLED == TRUE) &&   \
      (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSE))) &&             \
    !defined(__DOXYGEN__)
  #error "LSE not enabled, required by SYSTICK"
#endif

#if !defined(RCC_CCIPR2_DAC1SHSEL_LSE) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR2_DAC1SHSEL_LSE not defined"
#endif
#if !((STM32_LSE_ENABLED == TRUE) || !((STM32_DAC1SH_ENABLED == TRUE) &&    \
      (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_LSE))) &&               \
    !defined(__DOXYGEN__)
  #error "LSE not enabled, required by DAC1SH"
#endif

/**
 * @brief   LSE clock register bits.
 */
#if (STM32_LSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSE_BITS                    RCC_BDCR_LSEON
#else
  #define STM32_LSE_BITS                    0U
#endif

/**
 * @brief   Low frequency external oscillator clock point.
 */
#if (STM32_LSE_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSE_FREQ                    STM32_LSECLK
#else
  #define STM32_LSE_FREQ                    0U
#endif

#if !((STM32_LSE_ENABLED != TRUE) || (STM32_LSE_FREQ >= STM32_LSECLK_MIN)) && \
    !defined(__DOXYGEN__)
  #error "STM32_LSE_FREQ below minimum frequency"
#endif

#if !((STM32_LSE_ENABLED != TRUE) || (STM32_LSE_FREQ <= STM32_LSECLK_MAX)) && \
    !defined(__DOXYGEN__)
  #error "STM32_LSE_FREQ above maximum frequency"
#endif

/*--- Macros and checks for the LSI clock point. ---------------------------*/

#if !((STM32_CFG_LSI_ENABLE == TRUE) || (STM32_CFG_LSI_ENABLE == FALSE)) && \
    !defined(__DOXYGEN__)
  #error "invalid STM32_CFG_LSI_ENABLE value specified"
#endif

#if !defined(RCC_CFGR1_MCO1SEL_LSI) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO1SEL_LSI not defined"
#endif
#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_MCO1DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO1DIV_SEL == RCC_CFGR1_MCO1SEL_LSI))) && !defined(__DOXYGEN__)
  #error "LSI not enabled, required by MCO1DIV"
#endif

#if !defined(RCC_CFGR1_MCO2SEL_LSI) && !defined(__DOXYGEN__)
  #error "RCC_CFGR1_MCO2SEL_LSI not defined"
#endif
#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_MCO2DIV_ENABLED == TRUE) &&   \
      (STM32_CFG_MCO2DIV_SEL == RCC_CFGR1_MCO2SEL_LSI))) && !defined(__DOXYGEN__)
  #error "LSI not enabled, required by MCO2DIV"
#endif

#if !defined(RCC_BDCR_RTCSEL_LSI) && !defined(__DOXYGEN__)
  #error "RCC_BDCR_RTCSEL_LSI not defined"
#endif
#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_RTC_ENABLED == TRUE) &&       \
      (STM32_CFG_RTC_SEL == RCC_BDCR_RTCSEL_LSI))) && !defined(__DOXYGEN__)
  #error "LSI not enabled, required by RTC"
#endif

#if !defined(RCC_BDCR_LSCOSEL_LSI) && !defined(__DOXYGEN__)
  #error "RCC_BDCR_LSCOSEL_LSI not defined"
#endif
#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_LSCO_ENABLED == TRUE) &&      \
      (STM32_CFG_LSCO_SEL == RCC_BDCR_LSCOSEL_LSI))) && !defined(__DOXYGEN__)
  #error "LSI not enabled, required by LSCO"
#endif

#if !defined(RCC_CCIPR3_LPTIM1SEL_LSI) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_LPTIM1SEL_LSI not defined"
#endif
#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_LPTIM1_ENABLED == TRUE) &&    \
      (STM32_CFG_LPTIM1_SEL == RCC_CCIPR3_LPTIM1SEL_LSI))) &&               \
    !defined(__DOXYGEN__)
  #error "LSI not enabled, required by LPTIM1"
#endif

#if !defined(RCC_CCIPR1_LPTIM2SEL_LSI) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_LPTIM2SEL_LSI not defined"
#endif
#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_LPTIM2_ENABLED == TRUE) &&    \
      (STM32_CFG_LPTIM2_SEL == RCC_CCIPR1_LPTIM2SEL_LSI))) &&               \
    !defined(__DOXYGEN__)
  #error "LSI not enabled, required by LPTIM2"
#endif

#if !defined(RCC_CCIPR3_LPTIM34SEL_LSI) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR3_LPTIM34SEL_LSI not defined"
#endif
#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_LPTIM34_ENABLED == TRUE) &&   \
      (STM32_CFG_LPTIM34_SEL == RCC_CCIPR3_LPTIM34SEL_LSI))) &&             \
    !defined(__DOXYGEN__)
  #error "LSI not enabled, required by LPTIM34"
#endif

#if !defined(RCC_CCIPR1_SYSTICKSEL_LSI) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR1_SYSTICKSEL_LSI not defined"
#endif
#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_SYSTICK_ENABLED == TRUE) &&   \
      (STM32_CFG_SYSTICK_SEL == RCC_CCIPR1_SYSTICKSEL_LSI))) &&             \
    !defined(__DOXYGEN__)
  #error "LSI not enabled, required by SYSTICK"
#endif

#if !defined(RCC_CCIPR2_DAC1SHSEL_LSI) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR2_DAC1SHSEL_LSI not defined"
#endif
#if !((STM32_LSI_ENABLED == TRUE) || !((STM32_DAC1SH_ENABLED == TRUE) &&    \
      (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_LSI))) &&               \
    !defined(__DOXYGEN__)
  #error "LSI not enabled, required by DAC1SH"
#endif

/**
 * @brief   LSI clock register bits.
 */
#if (STM32_LSI_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSI_BITS                    RCC_CSR_LSION
#else
  #define STM32_LSI_BITS                    0U
#endif

/**
 * @brief   Low frequency internal oscillator clock point.
 */
#if (STM32_LSI_ENABLED == TRUE) || defined(__DOXYGEN__)
  #define STM32_LSI_FREQ                    STM32_LSICLK
#else
  #define STM32_LSI_FREQ                    0U
#endif

/*--- Macros and checks for the MSIRC0 clock point. ------------------------*/

/**
 * @brief   MSIRC0 clock register bits.
 */
#if (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || \
    defined(__DOXYGEN__)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_CR_BITS            RCC_CR_MSIPLL0EN
  #else
    #define STM32_MSIRC0_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_CR_BITS            RCC_CR_MSIPLL0EN
  #else
    #define STM32_MSIRC0_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_CR_BITS            (RCC_CR_MSIPLL0EN |             \
                                             RCC_CR_MSIPLL0FAST)
  #else
    #define STM32_MSIRC0_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE_FAST)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_CR_BITS            (RCC_CR_MSIPLL0EN |             \
                                             RCC_CR_MSIPLL0FAST)
  #else
    #define STM32_MSIRC0_CR_BITS            0U
  #endif
#else
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_CR_BITS            0U
  #else
    #define STM32_MSIRC0_CR_BITS            0U
  #endif
#endif

#if (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || \
    defined(__DOXYGEN__)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_ICSCR1_BITS        RCC_ICSCR1_MSIPLL0SEL_LSE
  #else
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_ICSCR1_BITS        (RCC_ICSCR1_MSIPLL0SEL_HSE |    \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_ICSCR1_BITS        RCC_ICSCR1_MSIPLL0SEL_LSE
  #else
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #endif
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE_FAST)
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_ICSCR1_BITS        (RCC_ICSCR1_MSIPLL0SEL_HSE |    \
                                             STM32_MSIHSINDIV)
  #else
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #endif
#else
  #if (STM32_MSIRC0_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #else
    #define STM32_MSIRC0_ICSCR1_BITS        0U
  #endif
#endif

/**
 * @brief   MSI 96MHz internal oscillator clock point.
 */
#if (STM32_MSIRC0_ENABLED == FALSE) && !defined(__DOXYGEN__)
  #define STM32_MSIRC0_FREQ                 0U
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE) || \
    defined(__DOXYGEN__)
  #define STM32_MSIRC0_FREQ                 96010000U
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE)
  #define STM32_MSIRC0_FREQ                 96000000U
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_LSE_FAST)
  #define STM32_MSIRC0_FREQ                 96010000U
#elif (STM32_CFG_MSIRC0_MODE == RCC_MSIRC0_PLL_HSE_FAST)
  #define STM32_MSIRC0_FREQ                 96000000U
#else
  #define STM32_MSIRC0_FREQ                 96000000U
#endif

/*--- Macros and checks for the MSIRC1 clock point. ------------------------*/

/**
 * @brief   MSIRC1 clock register bits.
 */
#if ((STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
     ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))) || \
    defined(__DOXYGEN__)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            RCC_CR_MSIPLL1EN
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_LSE_FAST)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      ((STM32_CFG_MSIPLL1N_VALUE == 0) || (STM32_CFG_MSIPLL1N_VALUE == 1))
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 2)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST) && \
      (STM32_CFG_MSIPLL1N_VALUE == 3)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#elif (STM32_CFG_MSIRC1_MODE == RCC_MSIRC1_PLL_HSE_FAST)
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            (RCC_CR_MSIPLL1EN |             \
                                             RCC_CR_MSIPLL1FAST)
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#else
  #if (STM32_MSIRC1_ENABLED == TRUE) || defined(__DOXYGEN__)
    #define STM32_MSIRC1_CR_BITS            0U
  #else
    #define STM32_MSIRC1_CR_BITS            0U
  #endif
#endif

