ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
/*--- Macros and checks for the I2C2 clock point. --------------------------*/

/**
 * @brief   I2C2 clock register bits.
 */
#if (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I2C2_BITS                   RCC_CCIPR1_I2C2SEL_PCLK1
#elif (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_MSIK)
  #define STM32_I2C2_BITS                   RCC_CCIPR1_I2C2SEL_MSIK
#else
  #error "invalid STM32_CFG_I2C2_SEL value specified"
#endif

/**
 * @brief   I2C2 clock clock point.
 */
#if ((STM32_I2C2_ENABLED == TRUE) && \
     (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C2_FREQ                   hal_lld_get_clock_point(CLK_PCLK1)
#elif (STM32_I2C2_ENABLED == TRUE) && \
      (STM32_CFG_I2C2_SEL == RCC_CCIPR1_I2C2SEL_MSIK)
  #define STM32_I2C2_FREQ                   hal_lld_get_clock_point(CLK_MSIK)
#else
  #define STM32_I2C2_FREQ                   0U
#endif

/*--- Macros and checks for the I2C3 clock point. --------------------------*/

/**
 * @brief   I2C3 clock register bits.
 */
#if (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_I2C3_BITS                   RCC_CCIPR3_I2C3SEL_PCLK3
#elif (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_MSIK)
  #define STM32_I2C3_BITS                   RCC_CCIPR3_I2C3SEL_MSIK
#else
  #error "invalid STM32_CFG_I2C3_SEL value specified"
#endif

/**
 * @brief   I2C3 clock clock point.
 */
#if ((STM32_I2C3_ENABLED == TRUE) && \
     (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_PCLK3)) || \
    defined(__DOXYGEN__)
  #define STM32_I2C3_FREQ                   hal_lld_get_clock_point(CLK_PCLK3)
#elif (STM32_I2C3_ENABLED == TRUE) && \
      (STM32_CFG_I2C3_SEL == RCC_CCIPR3_I2C3SEL_MSIK)
  #define STM32_I2C3_FREQ                   hal_lld_get_clock_point(CLK_MSIK)
#else
  #define STM32_I2C3_FREQ                   0U
#endif

/*--- Macros and checks for the I3C1 clock point. --------------------------*/

/**
 * @brief   I3C1 clock register bits.
 */
#if (STM32_CFG_I3C1_SEL == RCC_CCIPR1_I3C1SEL_PCLK1) || defined(__DOXYGEN__)
  #define STM32_I3C1_BITS                   RCC_CCIPR1_I3C1SEL_PCLK1
#elif (STM32_CFG_I3C1_SEL == RCC_CCIPR1_I3C1SEL_MSIK)
  #define STM32_I3C1_BITS                   RCC_CCIPR1_I3C1SEL_MSIK
#else
  #error "invalid STM32_CFG_I3C1_SEL value specified"
#endif

/**
 * @brief   I3C1 clock clock point.
 */
#if ((STM32_I3C1_ENABLED == TRUE) && \
     (STM32_CFG_I3C1_SEL == RCC_CCIPR1_I3C1SEL_PCLK1)) || \
    defined(__DOXYGEN__)
  #define STM32_I3C1_FREQ                   hal_lld_get_clock_point(CLK_PCLK1)
#elif (STM32_I3C1_ENABLED == TRUE) && \
      (STM32_CFG_I3C1_SEL == RCC_CCIPR1_I3C1SEL_MSIK)
  #define STM32_I3C1_FREQ                   hal_lld_get_clock_point(CLK_MSIK)
#else
  #define STM32_I3C1_FREQ                   0U
#endif

/*--- Macros and checks for the I3C2 clock point. --------------------------*/

/**
 * @brief   I3C2 clock register bits.
 */
#if (STM32_CFG_I3C2_SEL == RCC_CCIPR1_I3C2SEL_PCLK3) || defined(__DOXYGEN__)
  #define STM32_I3C2_BITS                   RCC_CCIPR1_I3C2SEL_PCLK3
#elif (STM32_CFG_I3C2_SEL == RCC_CCIPR1_I3C2SEL_MSIK)
  #define STM32_I3C2_BITS                   RCC_CCIPR1_I3C2SEL_MSIK
#else
  #error "invalid STM32_CFG_I3C2_SEL value specified"
#endif

/**
 * @brief   I3C2 clock clock point.
 */
#if ((STM32_I3C2_ENABLED == TRUE) && \
     (STM32_CFG_I3C2_SEL == RCC_CCIPR1_I3C2SEL_PCLK3)) || \
    defined(__DOXYGEN__)
  #define STM32_I3C2_FREQ                   hal_lld_get_clock_point(CLK_PCLK3)
#elif (STM32_I3C2_ENABLED == TRUE) && \
      (STM32_CFG_I3C2_SEL == RCC_CCIPR1_I3C2SEL_MSIK)
  #define STM32_I3C2_FREQ                   hal_lld_get_clock_point(CLK_MSIK)
#else
  #define STM32_I3C2_FREQ                   0U
#endif

/*--- Macros and checks for the ADCDAC clock point. ------------------------*/

/**
 * @brief   ADCDAC clock register bits.
 */
#if (STM32_CFG_ADCDAC_SEL == RCC_CCIPR2_ADCDACSEL_HCLK) || defined(__DOXYGEN__)
  #define STM32_ADCDAC_BITS                 RCC_CCIPR2_ADCDACSEL_HCLK
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR2_ADCDACSEL_HSE)
  #define STM32_ADCDAC_BITS                 RCC_CCIPR2_ADCDACSEL_HSE
#elif (STM32_CFG_ADCDAC_SEL == RCC_CCIPR2_ADCDACSEL_MSIK)
  #define STM32_ADCDAC_BITS                 RCC_CCIPR2_ADCDACSEL_MSIK
#else
  #error "invalid STM32_CFG_ADCDAC_SEL value specified"
#endif

/**
 * @brief   ADC and DAC clock clock point.
 */
#if ((STM32_ADCDAC_ENABLED == TRUE) && \
     (STM32_CFG_ADCDAC_SEL == RCC_CCIPR2_ADCDACSEL_HCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADCDAC_FREQ                 hal_lld_get_clock_point(CLK_HCLK)
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR2_ADCDACSEL_HSE)
  #define STM32_ADCDAC_FREQ                 hal_lld_get_clock_point(CLK_HSE)
#elif (STM32_ADCDAC_ENABLED == TRUE) && \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR2_ADCDACSEL_MSIK)
  #define STM32_ADCDAC_FREQ                 hal_lld_get_clock_point(CLK_MSIK)
#else
  #define STM32_ADCDAC_FREQ                 0U
#endif

#if !defined(RCC_CCIPR2_ADCDACSEL_HCLK) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR2_ADCDACSEL_HCLK not defined"
#endif
#if !(!((STM32_ADCDAC_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR2_ADCDACSEL_HCLK)) ||               \
     (STM32_HCLK_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADCDAC_FREQ above maximum frequency"
#endif

#if !(!((STM32_ADCDAC_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR2_ADCDACSEL_HSE)) ||                \
     (STM32_HSE_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADCDAC_FREQ above maximum frequency"
#endif

#if !defined(RCC_CCIPR2_ADCDACSEL_MSIK) && !defined(__DOXYGEN__)
  #error "RCC_CCIPR2_ADCDACSEL_MSIK not defined"
#endif
#if !(!((STM32_ADCDAC_ENABLED == TRUE) &&                                   \
      (STM32_CFG_ADCDAC_SEL == RCC_CCIPR2_ADCDACSEL_MSIK)) ||               \
     (STM32_MSIK_FREQ <= STM32_ADCCLK_MAX)) && !defined(__DOXYGEN__)
  #error "STM32_ADCDAC_FREQ above maximum frequency"
#endif

