ChibiOS/ChibiOS/os/hal/ports/STM32/STM32U3xx_TEST/clocktree.h
/*--- Macros and checks for the DAC1SH clock point. ------------------------*/

/**
 * @brief   DAC1SH clock register bits.
 */
#if (STM32_DAC1SH_ENABLED == FALSE)
  #define STM32_DAC1SH_BITS                 RCC_CCIPR2_DAC1SHSEL_IGNORE
#elif (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_IGNORE) ||              \
      defined(__DOXYGEN__)
  #define STM32_DAC1SH_BITS                 RCC_CCIPR2_DAC1SHSEL_IGNORE
#elif (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_LSE)
  #define STM32_DAC1SH_BITS                 RCC_CCIPR2_DAC1SHSEL_LSE
#elif (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_LSI)
  #define STM32_DAC1SH_BITS                 RCC_CCIPR2_DAC1SHSEL_LSI
#else
  #error "invalid STM32_CFG_DAC1SH_SEL value specified"
#endif

/**
 * @brief   DAC1 sample and hold clock clock point.
 */
#if ((STM32_DAC1SH_ENABLED == TRUE) && \
     (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_IGNORE)) || \
    defined(__DOXYGEN__)
  #define STM32_DAC1SH_FREQ                 STM32_NONE_FREQ
#elif (STM32_DAC1SH_ENABLED == TRUE) && \
      (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_LSE)
  #define STM32_DAC1SH_FREQ                 STM32_LSE_FREQ
#elif (STM32_DAC1SH_ENABLED == TRUE) && \
      (STM32_CFG_DAC1SH_SEL == RCC_CCIPR2_DAC1SHSEL_LSI)
  #define STM32_DAC1SH_FREQ                 STM32_LSI_FREQ
#else
  #define STM32_DAC1SH_FREQ                 0U
#endif

/*--- Macros and checks for the RNG clock point. ---------------------------*/

/**
 * @brief   RNG clock register bits.
 */
#if (STM32_RNG_ENABLED == FALSE)
  #define STM32_RNG_BITS                    RCC_CCIPR2_RNGSEL_IGNORE
#elif (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_IGNORE) || defined(__DOXYGEN__)
  #define STM32_RNG_BITS                    RCC_CCIPR2_RNGSEL_IGNORE
#elif (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48)
  #define STM32_RNG_BITS                    RCC_CCIPR2_RNGSEL_HSI48
#elif (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_MSIK)
  #define STM32_RNG_BITS                    RCC_CCIPR2_RNGSEL_MSIK
#else
  #error "invalid STM32_CFG_RNG_SEL value specified"
#endif

/**
 * @brief   RNG clock clock point.
 */
#if ((STM32_RNG_ENABLED == TRUE) && \
     (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_IGNORE)) || \
    defined(__DOXYGEN__)
  #define STM32_RNG_FREQ                    STM32_NONE_FREQ
#elif (STM32_RNG_ENABLED == TRUE) && \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_HSI48)
  #define STM32_RNG_FREQ                    hal_lld_get_clock_point(CLK_HSI48)
#elif (STM32_RNG_ENABLED == TRUE) && \
      (STM32_CFG_RNG_SEL == RCC_CCIPR2_RNGSEL_MSIK)
  #define STM32_RNG_FREQ                    hal_lld_get_clock_point(CLK_MSIK)
#else
  #define STM32_RNG_FREQ                    0U
#endif

/*--- Macros and checks for the FDCAN1 clock point. ------------------------*/

/**
 * @brief   FDCAN1 clock register bits.
 */
#if (STM32_FDCAN1_ENABLED == FALSE)
  #define STM32_FDCAN1_BITS                 RCC_CCIPR1_FDCAN1SEL_IGNORE
#elif (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_SYSCLK) ||              \
      defined(__DOXYGEN__)
  #define STM32_FDCAN1_BITS                 RCC_CCIPR1_FDCAN1SEL_SYSCLK
#elif (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_MSIK)
  #define STM32_FDCAN1_BITS                 RCC_CCIPR1_FDCAN1SEL_MSIK
#elif (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_IGNORE)
  #define STM32_FDCAN1_BITS                 RCC_CCIPR1_FDCAN1SEL_IGNORE
#else
  #error "invalid STM32_CFG_FDCAN1_SEL value specified"
#endif

/**
 * @brief   FDCAN1 clock clock point.
 */
#if ((STM32_FDCAN1_ENABLED == TRUE) && \
     (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_SYSCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_FDCAN1_FREQ                 hal_lld_get_clock_point(CLK_SYSCLK)
#elif (STM32_FDCAN1_ENABLED == TRUE) && \
      (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_MSIK)
  #define STM32_FDCAN1_FREQ                 hal_lld_get_clock_point(CLK_MSIK)
#elif (STM32_FDCAN1_ENABLED == TRUE) && \
      (STM32_CFG_FDCAN1_SEL == RCC_CCIPR1_FDCAN1SEL_IGNORE)
  #define STM32_FDCAN1_FREQ                 STM32_NONE_FREQ
#else
  #define STM32_FDCAN1_FREQ                 0U
#endif

/*--- Macros and checks for the SAI1 clock point. --------------------------*/

/**
 * @brief   SAI1 clock register bits.
 */
#if (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_MSIK) || defined(__DOXYGEN__)
  #define STM32_SAI1_BITS                   RCC_CCIPR2_SAI1SEL_MSIK
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_AUDIOCLK)
  #define STM32_SAI1_BITS                   RCC_CCIPR2_SAI1SEL_AUDIOCLK
#elif (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_HSE)
  #define STM32_SAI1_BITS                   RCC_CCIPR2_SAI1SEL_HSE
#else
  #error "invalid STM32_CFG_SAI1_SEL value specified"
#endif

/**
 * @brief   SAI1 clock clock point.
 */
#if ((STM32_SAI1_ENABLED == TRUE) && \
     (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_MSIK)) || \
    defined(__DOXYGEN__)
  #define STM32_SAI1_FREQ                   hal_lld_get_clock_point(CLK_MSIK)
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_AUDIOCLK)
  #define STM32_SAI1_FREQ                   STM32_AUDIOCLK_FREQ
#elif (STM32_SAI1_ENABLED == TRUE) && \
      (STM32_CFG_SAI1_SEL == RCC_CCIPR2_SAI1SEL_HSE)
  #define STM32_SAI1_FREQ                   hal_lld_get_clock_point(CLK_HSE)
#else
  #define STM32_SAI1_FREQ                   0U
#endif

/*--- Macros and checks for the ADF1 clock point. --------------------------*/

/**
 * @brief   ADF1 clock register bits.
 */
#if (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_HCLK) || defined(__DOXYGEN__)
  #define STM32_ADF1_BITS                   RCC_CCIPR2_ADF1SEL_HCLK
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_AUDIOCLK)
  #define STM32_ADF1_BITS                   RCC_CCIPR2_ADF1SEL_AUDIOCLK
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_HSE)
  #define STM32_ADF1_BITS                   RCC_CCIPR2_ADF1SEL_HSE
#elif (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_SAI1)
  #define STM32_ADF1_BITS                   RCC_CCIPR2_ADF1SEL_SAI1
#else
  #error "invalid STM32_CFG_ADF1_SEL value specified"
#endif

/**
 * @brief   ADF1 clock clock point.
 */
#if ((STM32_ADF1_ENABLED == TRUE) && \
     (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_HCLK)) || \
    defined(__DOXYGEN__)
  #define STM32_ADF1_FREQ                   hal_lld_get_clock_point(CLK_HCLK)
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_AUDIOCLK)
  #define STM32_ADF1_FREQ                   STM32_AUDIOCLK_FREQ
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_HSE)
  #define STM32_ADF1_FREQ                   hal_lld_get_clock_point(CLK_HSE)
#elif (STM32_ADF1_ENABLED == TRUE) && \
      (STM32_CFG_ADF1_SEL == RCC_CCIPR2_ADF1SEL_SAI1)
  #define STM32_ADF1_FREQ                   STM32_SAI1_FREQ
#else
  #define STM32_ADF1_FREQ                   0U
#endif
/** @} */

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @brief   Returns the frequency of a clock point in Hz.
 * @note    Static implementation.
 *
 * @param[in] clkpt     clock point to be returned
 * @return              The clock point frequency in Hz or zero if the
 *                      frequency is unknown.
 *
 * @notapi
 */
#if (STM32_CFG_CLOCK_DYNAMIC == FALSE) || defined(__DOXYGEN__)
#define hal_lld_get_clock_point(clkpt)                                      \
  ((clkpt) == CLK_HSI16        ? STM32_HSI16_FREQ         :                       \
   (clkpt) == CLK_HSI48        ? STM32_HSI48_FREQ         :                       \
   (clkpt) == CLK_HSE          ? STM32_HSE_FREQ           :                       \
   (clkpt) == CLK_MSIS         ? STM32_MSIS_FREQ          :                       \
   (clkpt) == CLK_MSIK         ? STM32_MSIK_FREQ          :                       \
   (clkpt) == CLK_SYSCLK       ? STM32_SYSCLK_FREQ        :                       \
   (clkpt) == CLK_HCLK         ? STM32_HCLK_FREQ          :                       \
   (clkpt) == CLK_PCLK1        ? STM32_PCLK1_FREQ         :                       \
   (clkpt) == CLK_PCLK1TIM     ? STM32_PCLK1TIM_FREQ      :                       \
   (clkpt) == CLK_PCLK2        ? STM32_PCLK2_FREQ         :                       \
   (clkpt) == CLK_PCLK2TIM     ? STM32_PCLK2TIM_FREQ      :                       \
   (clkpt) == CLK_PCLK3        ? STM32_PCLK3_FREQ         :                       \
   (clkpt) == CLK_MCO1         ? STM32_MCO1_FREQ          :                       \
   (clkpt) == CLK_MCO2         ? STM32_MCO2_FREQ          :                       \
   0U)
#endif

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#ifdef __cplusplus
extern "C" {
#endif
#ifdef __cplusplus
}
#endif

#endif /* CLOCKTREE_H */

/** @} */
